eecs393.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-10-12 Mon 15:29 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>EECS 393 Notes</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Stephen Brennan" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">EECS 393 Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline14">1. 2015-09-25 Friday</a>
<ul>
<li><a href="#orgheadline10">1.1. What are Requirements?</a>
<ul>
<li><a href="#orgheadline1">1.1.1. Functional Requirements</a></li>
<li><a href="#orgheadline2">1.1.2. Non-Functional Requirements</a></li>
<li><a href="#orgheadline3">1.1.3. Requirements vs Design</a></li>
<li><a href="#orgheadline4">1.1.4. Design Patterns in Requirements</a></li>
<li><a href="#orgheadline9">1.1.5. Detail</a></li>
</ul>
</li>
<li><a href="#orgheadline11">1.2. Software Features</a></li>
<li><a href="#orgheadline12">1.3. Properties of Good SRS</a></li>
<li><a href="#orgheadline13">1.4. Requirements Engineering</a></li>
</ul>
</li>
<li><a href="#orgheadline17">2. 2015-09-18 Friday</a>
<ul>
<li><a href="#orgheadline15">2.1. Information Gathering Techniques</a></li>
<li><a href="#orgheadline16">2.2. Use Case</a></li>
</ul>
</li>
<li><a href="#orgheadline19">3. 2015-09-16 Wednesday</a>
<ul>
<li><a href="#orgheadline18">3.1. Moar Requirements</a></li>
</ul>
</li>
<li><a href="#orgheadline21">4. 2015-09-11 Friday</a>
<ul>
<li><a href="#orgheadline20">4.1. Software Requirements</a></li>
</ul>
</li>
<li><a href="#orgheadline24">5. 2015-09-09 Wednesday</a>
<ul>
<li><a href="#orgheadline22">5.1. Software Process Models</a></li>
<li><a href="#orgheadline23">5.2. Agile Methods</a></li>
</ul>
</li>
<li><a href="#orgheadline27">6. 2015-09-02 Wednesday</a>
<ul>
<li><a href="#orgheadline25">6.1. Incremental Delivery</a></li>
<li><a href="#orgheadline26">6.2. Spiral Model</a></li>
</ul>
</li>
<li><a href="#orgheadline32">7. 2015-08-31-Monday</a>
<ul>
<li><a href="#orgheadline28">7.1. Objectives</a></li>
<li><a href="#orgheadline29">7.2. Inspection Roles</a></li>
<li><a href="#orgheadline30">7.3. Rules</a></li>
<li><a href="#orgheadline31">7.4. Checklists</a></li>
</ul>
</li>
<li><a href="#orgheadline39">8. 2015-08-28 Friday</a>
<ul>
<li><a href="#orgheadline33">8.1. Incentive Mismatch</a></li>
<li><a href="#orgheadline37">8.2. Prototyping</a>
<ul>
<li><a href="#orgheadline34">8.2.1. Types of prototyping</a></li>
<li><a href="#orgheadline35">8.2.2. Operational Prototyping</a></li>
<li><a href="#orgheadline36">8.2.3. Drawbacks of Prototyping</a></li>
</ul>
</li>
<li><a href="#orgheadline38">8.3. Incremental Delivery</a></li>
</ul>
</li>
<li><a href="#orgheadline47">9. 2015-08-26 Wednesday</a>
<ul>
<li><a href="#orgheadline46">9.1. Software Process Models</a>
<ul>
<li><a href="#orgheadline40">9.1.1. Anti-model: Build &amp; Fix</a></li>
<li><a href="#orgheadline44">9.1.2. Basic Waterfall Model</a></li>
<li><a href="#orgheadline45">9.1.3. Incentive Mismatch</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline55">10. 2015-08-24 Monday</a>
<ul>
<li><a href="#orgheadline54">10.1. Software Engineering</a>
<ul>
<li><a href="#orgheadline48">10.1.1. Goals of Saftware Engineering</a></li>
<li><a href="#orgheadline51">10.1.2. Aspects of Software Engineering</a></li>
<li><a href="#orgheadline52">10.1.3. Software Complexity</a></li>
<li><a href="#orgheadline53">10.1.4. Software Engineering Methodology</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14"><span class="section-number-2">1</span> 2015-09-25 Friday</h2>
<div class="outline-text-2" id="text-1">
<p>
Uh oh, there's a quiz today!  Better take notes on the last couple weeks of
stuff.  The material is essentially from last quiz (9/9) on.  Which appears to
be simply software requirements.  Let's gogogogo.
</p>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">1.1</span> What are Requirements?</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Properties your software must exhibit to meet needs (of users).</li>
<li>SRS = software requirements specification</li>
<li>Derived collaboratively: customer + devs</li>
<li>Process = req engineering</li>
<li>Lots of people use requirements!  Not just developers and customers, but
management, lawyers, documenters, etc.  And users.</li>
</ul>
</div>

<div id="outline-container-orgheadline1" class="outline-4">
<h4 id="orgheadline1"><span class="section-number-4">1.1.1</span> Functional Requirements</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>Describe functionality for users.</li>
<li>Use natural language + problem domain.</li>
<li>Can be a bit ambiguous, interpretable.</li>
<li>Can have hundreds or thousands.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2"><span class="section-number-4">1.1.2</span> Non-Functional Requirements</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>All the other requirements</li>
<li>Types:
<ul class="org-ul">
<li>Usability</li>
<li>Reliability</li>
<li>Availability</li>
<li>Efficiency/performance</li>
<li>Security</li>
<li>Hardware/software constraints</li>
<li>Portability</li>
<li>Compliance</li>
<li>Certification</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3"><span class="section-number-4">1.1.3</span> Requirements vs Design</h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li>You don't want to include "design" stuff in the SRS.
<ul class="org-ul">
<li>Requirements = what, not how</li>
<li>Don't want unnecessary constraints on the implementers.</li>
</ul></li>
<li>However, gotta be careful not to make your requirements too abstract.  You
need <i>some</i> details after all.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><span class="section-number-4">1.1.4</span> Design Patterns in Requirements</h4>
<div class="outline-text-4" id="text-1-1-4">
<ul class="org-ul">
<li>Design pattern = reusable solution to a recurring problem.</li>
<li>Requirements should have "architectural design patterns"</li>
<li>They will raise specific questions about what the product's requirements
ore.</li>
<li>For instance, if you have a web site for a music store, it raises a lot of
questions about the website that help clarify your requirements.</li>
<li>Much better than if you hadn't specified the "web store" design pattern.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><span class="section-number-4">1.1.5</span> Detail</h4>
<div class="outline-text-4" id="text-1-1-5">
<ul class="org-ul">
<li>Different levels for different people.</li>
<li>Different goals depending on who you're targeting.</li>
</ul>
</div>

<ol class="org-ol"><li><a id="orgheadline5"></a>Business Requirements<br  /><div class="outline-text-5" id="text-1-1-5-1">
<ul class="org-ul">
<li>High level</li>
<li>They are about business objectives.</li>
<li>Not much about the specific functionality.</li>
<li>EG: what are your goals with the software.  What business problem will
you solve, or objective will you satisfy.</li>
</ul>
</div></li>

<li><a id="orgheadline6"></a>User Requirements<br  /><div class="outline-text-5" id="text-1-1-5-2">
<ul class="org-ul">
<li>Describe tasks that users will accomplish.</li>
<li>You may have multiple user requirements that will relate to one business
requirement.</li>
</ul>
</div></li>

<li><a id="orgheadline7"></a>Functional/Non-Functional<br  /><div class="outline-text-5" id="text-1-1-5-3">
<ul class="org-ul">
<li>These are the most detailed requirements.</li>
<li>They describe functionality that satisfies user requirements.</li>
<li>Probably you'll get multiple F/NF reqs for a single User req.</li>
</ul>
</div></li>

<li><a id="orgheadline8"></a>Overall<br  /><div class="outline-text-5" id="text-1-1-5-4">
<p>
In essence, you use the business needs, or marketing information, to get
business requirements.  From there, you come up with the user requirements
to satisfy those, and then you make F/NF requriments that satisfy each user
requirement.
</p>
</div></li></ol>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">1.2</span> Software Features</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Groups of related FR's.</li>
<li>May influence customers to choose your product.</li>
<li>probably used in marketing.</li>
<li>Feature tree</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">1.3</span> Properties of Good SRS</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Complete - nothing missing.</li>
<li>Correct</li>
<li>Feasible - it should be possible to create the system in the available
resources and time.</li>
<li>Unambiguous - as much as possible :D</li>
<li>Consistent - no conflicts</li>
<li>Validateable - should be easy to say whether each requirement is satisfied.</li>
<li>Modifiable - you should be able to easily revise it with structure, labels,
stuff.</li>
<li>Traceable - each requirement should be linked back to its origin, and
froward to its design elements.  And the source code that implements it.
And the test cases that exercise it.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">1.4</span> Requirements Engineering</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Identify use cases</li>
<li>Analyze info from users.</li>
<li>Allocate requirements to top level components.</li>
<li>Negotiating priorities</li>
<li>Documenting the requirements (creating SRS)</li>
<li>Reviewing requirements to ensure everyone understands.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-2">
<h2 id="orgheadline17"><span class="section-number-2">2</span> 2015-09-18 Friday</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">2.1</span> Information Gathering Techniques</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Interviews</li>
<li>Facilitated requirements workshops</li>
<li>Document analysis.</li>
<li>Lots of stuff.</li>
</ul>
</div>
</div>
