eecs393.org
** Use Case

   - Describes a set of related usage scenarios for a software system.
   - Not sufficient as a list of functional requirements.
   - Can be used in addition to functional requirements.
   - Can derive functional requiremnets from each use case.

* 2015-09-16 Wednesday

** Moar Requirements

   Levels of Detail in Requirements Specification
   - Different audiences want different levels.
   - Business requirements: high level, business constraints, etc.
   - User requirements: describe what the users need to do.

* 2015-09-11 Friday

** Software Requirements

   - Properties a software product must exhibit to meet the needs of users.
   - Described in a softare requirements specification (SRS) document.
   - Should be derived and specified collaboratively w/ customer & devs.
   - Process of developing reqirements is called requirements engineering.

   Consumers of Requirements:
   - Project sponsors
   - Managers
   - Users
   - Designers
   - Programmers
   - Testers
   - Maintainers
   - Trainees
   - Documentation writers
   - Lawyers ("at the bottom")

   Functional Requirements
   - Describe functionality a product must provide.
   - Written primarily in natural language.
     - Shouldn't use any "technical language".  If any jargon is used, it should
       be the "product domain" jargon, not the software development jargon.
   - Open to interpretation, can be ambiguous, this should be resolved before
     design.
   - For a complex system, could be hundreds or thousands of requirements.

* 2015-09-09 Wednesday

  QUIZ TODAY.  Starts at 12:10.  Studying.  Two slide decks from previous
  lectures: Software Process Models and Agile Methods

** Software Process Models

   There are graphics to depict how software is made.

   Models:
   - Build & Fix (anti): Build first version, modify until client is fixed, and
     maintain.
     - No spec, design document.
     - Bad for large projects.
   - Basic Waterfall: Requirements -> Design -> Implementation -> Validation ->
     Maintenance.
     - Requirements: what it should do.
     - Design: how it will be structured to do it
   - Waterfall Augmented with Iteration: replace the validation stage with
     "integration", and from maintenance you can update requirements and go back
     to specification, design, implementation, etc.
     - Criticisms of Waterfall + Requirements are that they encourage lots of
       bulk and extra features.
   - Prototyping:
     - Throwaway - quick and dirty, focus on the risky stuff first, just to see
       whether the client likes it.
       - Prototyping done after outlining requirements, but before specification
         of the actual system.
     - Evolutionary - basics first to see what the client wants out of it.
     - Operational - observer goes to clients with evolutionary prototype.
       Watches clients and develops new throwaway prototypes.  If clients like
       it, he sends the requirements back to the team to create a new
       evolutionary prototype.
   - Incremental Delivery: basically iterated waterfall
     - Get sooner feedback, most important features get most testing.
     - Can respond to changing requirements better.
   - Spiral Model: for high risk projects.  Four stages: objectives, risk
     analysis, development+validation, planning.
     - Best when you have high risk, lots of time, and clients in the same
       organization.

** Agile Methods

   - Aim to respond better to frequent changes, with less emphasis on planning,
     design, and documentation.
   - Extreme Programming
     - Principles
       - Rapid feedback
       - Simplicity
       - Embracing changes
       - Quality work
     - Practices
       - Planning - user stories, cards, prioritize, etc.
       - Small releases, working system after just a few releases.  (every few
         days/weeks)
       - Metaphors
       - Simple design - remove complexity
       - TDD
* 2015-09-02 Wednesday

** Incremental Delivery

   - Series of builds, each provides a subset of functionality.
   - Each increment follows a pretty standard waterfall design process.
   - Very similar to an evolutionary prototype, but with waterfall in each
     increment.

   Advantages:

   - Client can exploint product functionality sooner.
   - Client can adapt gradually.
   - Developer gets earlier feedback.

** Spiral Model
   - For mega defense stuff.
   - Four phases:
     - 
* 2015-08-31-Monday
  *GUEST SPEAKER ON INPSECTIONS*

  Why inspect?  To hold your company's code to a standard of excellence by
  finding defects in code before it's shipped.  It also makes developers more
  disciplined in creating code that satisfies your standards.

** Objectives
   - Promote completeness and correctness in the product.
   - Promote adherence to project style and rules of construction.
   - Compliance with the technology practices of the organization.
   - Examination of the product from the user's viewpoint as well as the
     producer's.

** Inspection Roles

   - Author - developer responsible for work product.
   - Inspectors - inspect work product
   - Scribe/Recorder - records the issues
   - Moderator - directs preparation and inspection meeting; reports results to
     manager.
   - Manager - schedules inspection, assigns moderator and team, manages
     follow-up.

** Rules

   - Manager is not present.
   - Inspectors take turns presenting issues.
   - Inspectors are tactful.
   - Author does not defend work.
   - Problems are not solved at the meeting.

** Checklists

   - PEP8
   - Useful for reminding inspector of important issues.
   - May inhibit them from discovering other issues.
   - Perhaps best consulted after first read of work product.
* 2015-08-28 Friday

