eecs393.html

<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">2.2</span> Use Case</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Describes a set of related usage scenarios for a software system.</li>
<li>Not sufficient as a list of functional requirements.</li>
<li>Can be used in addition to functional requirements.</li>
<li>Can derive functional requiremnets from each use case.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline19" class="outline-2">
<h2 id="orgheadline19"><span class="section-number-2">3</span> 2015-09-16 Wednesday</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">3.1</span> Moar Requirements</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Levels of Detail in Requirements Specification
</p>
<ul class="org-ul">
<li>Different audiences want different levels.</li>
<li>Business requirements: high level, business constraints, etc.</li>
<li>User requirements: describe what the users need to do.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline21" class="outline-2">
<h2 id="orgheadline21"><span class="section-number-2">4</span> 2015-09-11 Friday</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20"><span class="section-number-3">4.1</span> Software Requirements</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Properties a software product must exhibit to meet the needs of users.</li>
<li>Described in a softare requirements specification (SRS) document.</li>
<li>Should be derived and specified collaboratively w/ customer &amp; devs.</li>
<li>Process of developing reqirements is called requirements engineering.</li>
</ul>

<p>
Consumers of Requirements:
</p>
<ul class="org-ul">
<li>Project sponsors</li>
<li>Managers</li>
<li>Users</li>
<li>Designers</li>
<li>Programmers</li>
<li>Testers</li>
<li>Maintainers</li>
<li>Trainees</li>
<li>Documentation writers</li>
<li>Lawyers ("at the bottom")</li>
</ul>

<p>
Functional Requirements
</p>
<ul class="org-ul">
<li>Describe functionality a product must provide.</li>
<li>Written primarily in natural language.
<ul class="org-ul">
<li>Shouldn't use any "technical language".  If any jargon is used, it should
be the "product domain" jargon, not the software development jargon.</li>
</ul></li>
<li>Open to interpretation, can be ambiguous, this should be resolved before
design.</li>
<li>For a complex system, could be hundreds or thousands of requirements.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline24" class="outline-2">
<h2 id="orgheadline24"><span class="section-number-2">5</span> 2015-09-09 Wednesday</h2>
<div class="outline-text-2" id="text-5">
<p>
QUIZ TODAY.  Starts at 12:10.  Studying.  Two slide decks from previous
lectures: Software Process Models and Agile Methods
</p>
</div>

<div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22"><span class="section-number-3">5.1</span> Software Process Models</h3>
<div class="outline-text-3" id="text-5-1">
<p>
There are graphics to depict how software is made.
</p>

<p>
Models:
</p>
<ul class="org-ul">
<li>Build &amp; Fix (anti): Build first version, modify until client is fixed, and
maintain.
<ul class="org-ul">
<li>No spec, design document.</li>
<li>Bad for large projects.</li>
</ul></li>
<li>Basic Waterfall: Requirements -&gt; Design -&gt; Implementation -&gt; Validation -&gt;
Maintenance.
<ul class="org-ul">
<li>Requirements: what it should do.</li>
<li>Design: how it will be structured to do it</li>
</ul></li>
<li>Waterfall Augmented with Iteration: replace the validation stage with
"integration", and from maintenance you can update requirements and go back
to specification, design, implementation, etc.
<ul class="org-ul">
<li>Criticisms of Waterfall + Requirements are that they encourage lots of
bulk and extra features.</li>
</ul></li>
<li>Prototyping:
<ul class="org-ul">
<li>Throwaway - quick and dirty, focus on the risky stuff first, just to see
whether the client likes it.
<ul class="org-ul">
<li>Prototyping done after outlining requirements, but before specification
of the actual system.</li>
</ul></li>
<li>Evolutionary - basics first to see what the client wants out of it.</li>
<li>Operational - observer goes to clients with evolutionary prototype.
Watches clients and develops new throwaway prototypes.  If clients like
it, he sends the requirements back to the team to create a new
evolutionary prototype.</li>
</ul></li>
<li>Incremental Delivery: basically iterated waterfall
<ul class="org-ul">
<li>Get sooner feedback, most important features get most testing.</li>
<li>Can respond to changing requirements better.</li>
</ul></li>
<li>Spiral Model: for high risk projects.  Four stages: objectives, risk
analysis, development+validation, planning.
<ul class="org-ul">
<li>Best when you have high risk, lots of time, and clients in the same
organization.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline23" class="outline-3">
<h3 id="orgheadline23"><span class="section-number-3">5.2</span> Agile Methods</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Aim to respond better to frequent changes, with less emphasis on planning,
design, and documentation.</li>
<li>Extreme Programming
<ul class="org-ul">
<li>Principles
<ul class="org-ul">
<li>Rapid feedback</li>
<li>Simplicity</li>
<li>Embracing changes</li>
<li>Quality work</li>
</ul></li>
<li>Practices
<ul class="org-ul">
<li>Planning - user stories, cards, prioritize, etc.</li>
<li>Small releases, working system after just a few releases.  (every few
days/weeks)</li>
<li>Metaphors</li>
<li>Simple design - remove complexity</li>
<li>TDD</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline27" class="outline-2">
<h2 id="orgheadline27"><span class="section-number-2">6</span> 2015-09-02 Wednesday</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-orgheadline25" class="outline-3">
<h3 id="orgheadline25"><span class="section-number-3">6.1</span> Incremental Delivery</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>Series of builds, each provides a subset of functionality.</li>
<li>Each increment follows a pretty standard waterfall design process.</li>
<li>Very similar to an evolutionary prototype, but with waterfall in each
increment.</li>
</ul>

<p>
Advantages:
</p>

<ul class="org-ul">
<li>Client can exploint product functionality sooner.</li>
<li>Client can adapt gradually.</li>
<li>Developer gets earlier feedback.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline26" class="outline-3">
<h3 id="orgheadline26"><span class="section-number-3">6.2</span> Spiral Model</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>For mega defense stuff.</li>
<li>Four phases:
<ul class="org-ul">
<li></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline32" class="outline-2">
<h2 id="orgheadline32"><span class="section-number-2">7</span> 2015-08-31-Monday</h2>
<div class="outline-text-2" id="text-7">
<p>
<b>GUEST SPEAKER ON INPSECTIONS</b>
</p>

<p>
Why inspect?  To hold your company's code to a standard of excellence by
finding defects in code before it's shipped.  It also makes developers more
disciplined in creating code that satisfies your standards.
</p>
</div>

<div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28"><span class="section-number-3">7.1</span> Objectives</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>Promote completeness and correctness in the product.</li>
<li>Promote adherence to project style and rules of construction.</li>
<li>Compliance with the technology practices of the organization.</li>
<li>Examination of the product from the user's viewpoint as well as the
producer's.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline29" class="outline-3">
<h3 id="orgheadline29"><span class="section-number-3">7.2</span> Inspection Roles</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>Author - developer responsible for work product.</li>
<li>Inspectors - inspect work product</li>
<li>Scribe/Recorder - records the issues</li>
<li>Moderator - directs preparation and inspection meeting; reports results to
manager.</li>
<li>Manager - schedules inspection, assigns moderator and team, manages
follow-up.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline30" class="outline-3">
<h3 id="orgheadline30"><span class="section-number-3">7.3</span> Rules</h3>
<div class="outline-text-3" id="text-7-3">
<ul class="org-ul">
<li>Manager is not present.</li>
<li>Inspectors take turns presenting issues.</li>
<li>Inspectors are tactful.</li>
<li>Author does not defend work.</li>
<li>Problems are not solved at the meeting.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31"><span class="section-number-3">7.4</span> Checklists</h3>
<div class="outline-text-3" id="text-7-4">
<ul class="org-ul">
<li>PEP8</li>
<li>Useful for reminding inspector of important issues.</li>
<li>May inhibit them from discovering other issues.</li>
<li>Perhaps best consulted after first read of work product.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline39" class="outline-2">
<h2 id="orgheadline39"><span class="section-number-2">8</span> 2015-08-28 Friday</h2>
