eecs393.org
** Incentive Mismatch

   - Schrage claims that requirements create perverse incentives.
   - It's easy for a client to build a "wish list" of requirements.
   - Developers are paid to implement requirements, so they do it.
   - He advocated for "prototyping", and for small requirements.
   - He says that it makes clients more likely to accept the result (if it's
     perceived as partly their work as well).

** Prototyping

   - A prototype is an incomplete model (typically executable, not just a
     storyboard) of a system.  It's made rapidly based on your initial
     requirements and provided to users for evaluation and feedback.
   - Makes it easier to refine and validate the requirements, especially with
     look and feel / UI.
   - Also can be good to validate internal design, like performance.
   - Focus on the areas of greatest risk for the project.
   - To rapidly prototype:
     - Omit functionality.
     - Ignore non-functional constraints (like efficiency)
     - Reuse existing components, use rapid prototyping languages like Python!

***   Types of prototyping

      - Throwaway - not built upon later.  It might be pretty awful, but it
        works.
        - Goal is to build the poorly understood parts first to clarify the
       requirements.
      - Evolutionary - will be refined iteratively to create the final product.
        (IT'S SO AGILE!)
        - Usually needs refactoring
        - Goal is to build the well understood parts first, and uncover any
          unkown requirements as you go, evolving to fit the requirements.

*** Operational Prototyping

      - Combines thrawaway and evolutionary prototyping.
      - An evolutionary prototype is constructed and made into a baseline using
        conventional methods.
      - Copies of he baseline are sent to multiple customer sites with a trained
        prototyper.
      - At each site, the prototyper observes the use of the system and tracks
        feature requests/issues/etc.
      - After the observation period, prototyper adds a throwaway prototype on
        top of the baseline, and the user evaluates them.
        - If they're ineffective, they are removed.
        - If the users like the new prototype, the prototyper submits a change
          request to the development team, and the development team works on the
          evolutionary prototype.

*** Drawbacks of Prototyping

    - You neglect up-front analysis by relying on the customer to provide
      feedback.  There's a bit of a tradeoff here.
    - Users might misunderstood the purpose of the prototype:
      - Maybe they'll like it too much and keep it, and not finish the contract.
      - Maybe they'll think it's bad and lose confidence in the developer.
    - Can lead to feature creep when you accomodate every feature request.
    - Wasted effort prototyping (when you could have drawn on paper, or verbally
      asked, etc...).

** Incremental Delivery

   This is a "tweak" to evolutionary prototyping.  It's the basis for AGILE.

   - Built + delivered in increments/builds.
   - Each increment provides a subset of the system's functionality.
   - Services are allocated to increments based on customer's priorities.
   - Conventional development process is applied to each increment.  (AGILE
     methods sometimes skimp on this).
* 2015-08-26 Wednesday

** Software Process Models

   - Graphical models of the software development process.
   - Characterize workflow
   - Have descriptive and prescriptive purposes
     - Some people advocate models that will help you make better software.

*** Anti-model: Build & Fix

    - Build first version
    - Modify until client is satisfied

    Problems with this:

    - Product is implemented without specification or design documents. (!)
      - Lack of planning... it sucks.
    - Reworked until the client is satisfied.
      - This is a moving target.
    - Works poorly for large products.
    - Maintenance is likely to be very difficult.

    Ways to improve:

    - Add a requirements document.
    - Add a planning stage.

*** Basic Waterfall Model

    - Phases: (this is kinda a combination of multiple slides)
      - Requirements
        - Elicitation and analysis: determine what it should do.  This is a good
          time to meet with a client and help them describe exactly what their
          software should do.
        - Specification: after your analysis, you write a specification of what
          the software should do.  Called SRS
      - Design: intermediate between requirements and implementation.  Describes
        the structure and behavior in a way that satisfies the requirements, but
        doesn't actually implement it.
      - Implementation: coding yo.
      - Validation: the set of activities that you do to make sure you deliver
        the right product.
        - Testing!!
        - Previews for customer to make sure they're satisfied.
        - Integration - combining the components into a working system.
        - Deployment - send out teh binaries
      - Maintenance: repair, adapt, or enhance the system as needed.
    - Pretty much all software development models will contain some variation of
      these phases, but not necessarily in the same order, or linearly.
    - Stage called "Verification" is for formal reasoning and proofs of
      correction.

**** Waterfall Augmented With Iteration

     - Basically adds a whole bunch of transitions, to make maintenance more
       nice.

**** Waterfall  Advantages

     - It is disciplined, if you do it right.  Which is much better than just
       "build and fix."
     - If you're careful, the analysis+docs can prevent costly problems later.
     - Documentation typically fall out of date, so it takes a ton of effort to
       "be careful".

**** Waterfall Disadvantages

     - Difficult to convey dynamics of a system in a document.
     - Customers often can't tell what they want/don't want until they see it.
     - Requirements can also change for reasons other than shifting wants.
     - Sometimes you only really understand the requirements when you try to
       implement them.
     - Diffcult to assess your progress until some things are implemented.

