eecs393.html
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-orgheadline33" class="outline-3">
<h3 id="orgheadline33"><span class="section-number-3">8.1</span> Incentive Mismatch</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>Schrage claims that requirements create perverse incentives.</li>
<li>It's easy for a client to build a "wish list" of requirements.</li>
<li>Developers are paid to implement requirements, so they do it.</li>
<li>He advocated for "prototyping", and for small requirements.</li>
<li>He says that it makes clients more likely to accept the result (if it's
perceived as partly their work as well).</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline37" class="outline-3">
<h3 id="orgheadline37"><span class="section-number-3">8.2</span> Prototyping</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li>A prototype is an incomplete model (typically executable, not just a
storyboard) of a system.  It's made rapidly based on your initial
requirements and provided to users for evaluation and feedback.</li>
<li>Makes it easier to refine and validate the requirements, especially with
look and feel / UI.</li>
<li>Also can be good to validate internal design, like performance.</li>
<li>Focus on the areas of greatest risk for the project.</li>
<li>To rapidly prototype:
<ul class="org-ul">
<li>Omit functionality.</li>
<li>Ignore non-functional constraints (like efficiency)</li>
<li>Reuse existing components, use rapid prototyping languages like Python!</li>
</ul></li>
</ul>
</div>

<div id="outline-container-orgheadline34" class="outline-4">
<h4 id="orgheadline34"><span class="section-number-4">8.2.1</span> Types of prototyping</h4>
<div class="outline-text-4" id="text-8-2-1">
<ul class="org-ul">
<li><p>
Throwaway - not built upon later.  It might be pretty awful, but it
works.
</p>
<ul class="org-ul">
<li>Goal is to build the poorly understood parts first to clarify the</li>
</ul>
<p>
requirements.
</p></li>
<li>Evolutionary - will be refined iteratively to create the final product.
(IT'S SO AGILE!)
<ul class="org-ul">
<li>Usually needs refactoring</li>
<li>Goal is to build the well understood parts first, and uncover any
unkown requirements as you go, evolving to fit the requirements.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline35" class="outline-4">
<h4 id="orgheadline35"><span class="section-number-4">8.2.2</span> Operational Prototyping</h4>
<div class="outline-text-4" id="text-8-2-2">
<ul class="org-ul">
<li>Combines thrawaway and evolutionary prototyping.</li>
<li>An evolutionary prototype is constructed and made into a baseline using
conventional methods.</li>
<li>Copies of he baseline are sent to multiple customer sites with a trained
prototyper.</li>
<li>At each site, the prototyper observes the use of the system and tracks
feature requests/issues/etc.</li>
<li>After the observation period, prototyper adds a throwaway prototype on
top of the baseline, and the user evaluates them.
<ul class="org-ul">
<li>If they're ineffective, they are removed.</li>
<li>If the users like the new prototype, the prototyper submits a change
request to the development team, and the development team works on the
evolutionary prototype.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline36" class="outline-4">
<h4 id="orgheadline36"><span class="section-number-4">8.2.3</span> Drawbacks of Prototyping</h4>
<div class="outline-text-4" id="text-8-2-3">
<ul class="org-ul">
<li>You neglect up-front analysis by relying on the customer to provide
feedback.  There's a bit of a tradeoff here.</li>
<li>Users might misunderstood the purpose of the prototype:
<ul class="org-ul">
<li>Maybe they'll like it too much and keep it, and not finish the contract.</li>
<li>Maybe they'll think it's bad and lose confidence in the developer.</li>
</ul></li>
<li>Can lead to feature creep when you accomodate every feature request.</li>
<li>Wasted effort prototyping (when you could have drawn on paper, or verbally
asked, etc&#x2026;).</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline38" class="outline-3">
<h3 id="orgheadline38"><span class="section-number-3">8.3</span> Incremental Delivery</h3>
<div class="outline-text-3" id="text-8-3">
<p>
This is a "tweak" to evolutionary prototyping.  It's the basis for AGILE.
</p>

<ul class="org-ul">
<li>Built + delivered in increments/builds.</li>
<li>Each increment provides a subset of the system's functionality.</li>
<li>Services are allocated to increments based on customer's priorities.</li>
<li>Conventional development process is applied to each increment.  (AGILE
methods sometimes skimp on this).</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline47" class="outline-2">
<h2 id="orgheadline47"><span class="section-number-2">9</span> 2015-08-26 Wednesday</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-orgheadline46" class="outline-3">
<h3 id="orgheadline46"><span class="section-number-3">9.1</span> Software Process Models</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li>Graphical models of the software development process.</li>
<li>Characterize workflow</li>
<li>Have descriptive and prescriptive purposes
<ul class="org-ul">
<li>Some people advocate models that will help you make better software.</li>
</ul></li>
</ul>
</div>

<div id="outline-container-orgheadline40" class="outline-4">
<h4 id="orgheadline40"><span class="section-number-4">9.1.1</span> Anti-model: Build &amp; Fix</h4>
<div class="outline-text-4" id="text-9-1-1">
<ul class="org-ul">
<li>Build first version</li>
<li>Modify until client is satisfied</li>
</ul>

<p>
Problems with this:
</p>

<ul class="org-ul">
<li>Product is implemented without specification or design documents. (!)
<ul class="org-ul">
<li>Lack of planning&#x2026; it sucks.</li>
</ul></li>
<li>Reworked until the client is satisfied.
<ul class="org-ul">
<li>This is a moving target.</li>
</ul></li>
<li>Works poorly for large products.</li>
<li>Maintenance is likely to be very difficult.</li>
</ul>

<p>
Ways to improve:
</p>

<ul class="org-ul">
<li>Add a requirements document.</li>
<li>Add a planning stage.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline44" class="outline-4">
<h4 id="orgheadline44"><span class="section-number-4">9.1.2</span> Basic Waterfall Model</h4>
<div class="outline-text-4" id="text-9-1-2">
<ul class="org-ul">
<li>Phases: (this is kinda a combination of multiple slides)
<ul class="org-ul">
<li>Requirements
<ul class="org-ul">
<li>Elicitation and analysis: determine what it should do.  This is a good
time to meet with a client and help them describe exactly what their
software should do.</li>
<li>Specification: after your analysis, you write a specification of what
the software should do.  Called SRS</li>
</ul></li>
<li>Design: intermediate between requirements and implementation.  Describes
the structure and behavior in a way that satisfies the requirements, but
doesn't actually implement it.</li>
<li>Implementation: coding yo.</li>
<li>Validation: the set of activities that you do to make sure you deliver
the right product.
<ul class="org-ul">
<li>Testing!!</li>
<li>Previews for customer to make sure they're satisfied.</li>
<li>Integration - combining the components into a working system.</li>
<li>Deployment - send out teh binaries</li>
</ul></li>
<li>Maintenance: repair, adapt, or enhance the system as needed.</li>
</ul></li>
<li>Pretty much all software development models will contain some variation of
these phases, but not necessarily in the same order, or linearly.</li>
<li>Stage called "Verification" is for formal reasoning and proofs of
correction.</li>
</ul>
</div>

<ol class="org-ol"><li><a id="orgheadline41"></a>Waterfall Augmented With Iteration<br  /><div class="outline-text-5" id="text-9-1-2-1">
<ul class="org-ul">
<li>Basically adds a whole bunch of transitions, to make maintenance more
nice.</li>
</ul>
</div></li>

<li><a id="orgheadline42"></a>Waterfall  Advantages<br  /><div class="outline-text-5" id="text-9-1-2-2">
<ul class="org-ul">
<li>It is disciplined, if you do it right.  Which is much better than just
"build and fix."</li>
<li>If you're careful, the analysis+docs can prevent costly problems later.</li>
<li>Documentation typically fall out of date, so it takes a ton of effort to
"be careful".</li>
</ul>
</div></li>

<li><a id="orgheadline43"></a>Waterfall Disadvantages<br  /><div class="outline-text-5" id="text-9-1-2-3">
<ul class="org-ul">
<li>Difficult to convey dynamics of a system in a document.</li>
<li>Customers often can't tell what they want/don't want until they see it.</li>
<li>Requirements can also change for reasons other than shifting wants.</li>
<li>Sometimes you only really understand the requirements when you try to
implement them.</li>
<li>Diffcult to assess your progress until some things are implemented.</li>
</ul>
</div></li></ol>
</div>
