eecs393.html

<div id="outline-container-orgheadline45" class="outline-4">
<h4 id="orgheadline45"><span class="section-number-4">9.1.3</span> Incentive Mismatch</h4>
<div class="outline-text-4" id="text-9-1-3">
<ul class="org-ul">
<li>Schrage claims requirements create perverse incentives for clients to:
<ul class="org-ul">
<li>Avoid rigorous thinking about cost, change, priorities, and risk.</li>
<li>Delegate hard design decisions to software developers.</li>
</ul></li>
<li>It's easy and inexpensive to come up with many requirements.  They're
"wishes".  It's easy.</li>
<li>Developers are rewarded for building to requirements.</li>
<li>Not rewarded for finding and removing requirements.</li>
<li>Schrage argues for quick prototypes based on few requirements.
<ul class="org-ul">
<li>"Never go to a client meeting without a prototype."</li>
<li>This fosters ongoing client interaction in development.</li>
<li>Clients are also less likely to reject their own work.</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline55" class="outline-2">
<h2 id="orgheadline55"><span class="section-number-2">10</span> 2015-08-24 Monday</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>I'm definitely going to switch to undergrad version of this class.</li>
<li>Quizzes - 60%</li>
<li>Project - 40%.</li>
<li>"Try" to get 8-10 quizzes.</li>
<li>Drop 2 lowest quizzes.</li>
</ul>
</div>

<div id="outline-container-orgheadline54" class="outline-3">
<h3 id="orgheadline54"><span class="section-number-3">10.1</span> Software Engineering</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Multiple meanings:
</p>

<ul class="org-ul">
<li>Application of engineering principles to software development.  Whatever
those "engineering principles" are.
<ul class="org-ul">
<li>NATO stuff - many NATO countries had to do military software dev.</li>
<li>They held a conference to solve their problems by applying engineering
practices.</li>
<li>Specification documents, etc.</li>
</ul></li>
<li>Name of the software engineering practice.</li>
<li>Something else</li>
</ul>
</div>

<div id="outline-container-orgheadline48" class="outline-4">
<h4 id="orgheadline48"><span class="section-number-4">10.1.1</span> Goals of Saftware Engineering</h4>
<div class="outline-text-4" id="text-10-1-1">
<p>
To produce, as quickly and inexpensively as possible, software that is:
</p>

<ul class="org-ul">
<li>Easy to use</li>
<li>Reliable</li>
<li>Something</li>
<li>Straightforward to maintain, adapt, and enhance</li>
<li>Secure (lol)</li>
</ul>

<p>
Generally most of software engineering is actually maintaining, adapting,
and enhancing.  Not constructing.
</p>
</div>
</div>

<div id="outline-container-orgheadline51" class="outline-4">
<h4 id="orgheadline51"><span class="section-number-4">10.1.2</span> Aspects of Software Engineering</h4>
<div class="outline-text-4" id="text-10-1-2">
</div><ol class="org-ol"><li><a id="orgheadline49"></a>Technical<br  /><div class="outline-text-5" id="text-10-1-2-1">
<ul class="org-ul">
<li>Specification - creating a document that says exactly what a software or
subsystem will do.</li>
<li>Design - taking a specification and coming up with a "design" that will
do what the spec says.  Design is high level (not code), like UML, etc.</li>
<li>Programming - taking the design and putting it into code.</li>
<li>Inspection and Testing</li>
<li>Static &amp; dynamic analysis</li>
<li>Debugging</li>
<li>Maintenance</li>
<li>Configuration management</li>
</ul>
</div></li>

<li><a id="orgheadline50"></a>Non-Technical<br  /><div class="outline-text-5" id="text-10-1-2-2">
<ul class="org-ul">
<li>Project management</li>
<li>Psychology
<ul class="org-ul">
<li>cognitive, behavioral, organization</li>
</ul></li>
<li>Law
<ul class="org-ul">
<li>contracts, liability, intellectual property</li>
</ul></li>
</ul>
</div></li></ol>
</div>

<div id="outline-container-orgheadline52" class="outline-4">
<h4 id="orgheadline52"><span class="section-number-4">10.1.3</span> Software Complexity</h4>
<div class="outline-text-4" id="text-10-1-3">
<p>
Primary issue for software dev: complexity:
</p>

<ul class="org-ul">
<li>problem complexity</li>
<li>design/implementation complexity</li>
<li>platform complexity</li>
</ul>

<p>
Large systems are among the most complex things produced by humans.
(e.g. Windows 8.1 - 80 million lines of code).
</p>

<ul class="org-ul">
<li>Complex systems are difficult to understand, produce, and maintain.</li>
<li>They rarely satisfy every need, and the needs often are a moving target.</li>
<li>They always contain "residual defects" that you don't know about.</li>
<li>Many SD projects are late and over budget.
<ul class="org-ul">
<li>Some just never complete.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline53" class="outline-4">
<h4 id="orgheadline53"><span class="section-number-4">10.1.4</span> Software Engineering Methodology</h4>
<div class="outline-text-4" id="text-10-1-4">
<ul class="org-ul">
<li>Broad collection of techniques and tools addressing each phase of software
development.</li>
<li>Continually evolving</li>
<li>Specialized for subfields:
<ul class="org-ul">
<li>Web</li>
<li>Real-time</li>
<li>Health</li>
</ul></li>
<li>Influential methods:
<ul class="org-ul">
<li>OO</li>
<li>TDD</li>
<li>Agile</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Stephen Brennan</p>
<p class="date">Created: 2015-10-12 Mon 15:29</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
